app/controllers/blogs_controller.rb

  def index
    if logged_in?(:site_admin)
      @blogs = Blog.recent.page(params[:page]).per(5)
---
SELECT "blogs".* FROM "blogs"

  def show
    if logged_in?(:site_admin) || @blog.published?
      @blog = Blog.includes(:comments).friendly.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "This is cool"], ["body", "Very cool\r\n"], ["created_at", 2017-02-21 19:02:47 UTC], ["updated_at", 2017-02-21 19:02:47 UTC]]

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "body" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["body", "asdfasfasdfasdfasdf"], ["updated_at", 2017-02-21 20:47:04 UTC], ["id", 4]]